livello/nrf51_vesc/main.c
/*
	Copyright 2017 - 2019 Benjamin Vedder	benjamin@vedder.se

	This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
    */

#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>

#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "nrf_delay.h"
#include "nrf_drv_clock.h"

#include "pca10028.h"

#include "nrf51_bitfields.h"
#include "nrf_uart.h"
#include "nrf51.h"

#include "nrf_esb.h"
#include "nrf_error.h"
#include "nrf_esb_error_codes.h"

#include "packet.h"
#include "crc.h"
#include "buffer.h"
#include "datatypes.h"

#ifndef FW_16K
#include "esb_timeslot.h"
#endif

#if 0
#ifdef APP_ERROR_CHECK
#undef APP_ERROR_CHECK
#endif
void my_printf(const char* format, ...);
#define APP_ERROR_CHECK(ERR_CODE)                       \
do                                                      \
{                                                       \
	if (ERR_CODE != NRF_SUCCESS)                  		\
		{                                               \
			my_printf("Error %d: %s L %d\r\n", ERR_CODE, __FILE__, __LINE__); \
        }                                               \
} while (0)
#endif

#define PRINT_EN						0

#ifndef MODULE_TRAMPA
#define MODULE_TRAMPA					0
#endif

#ifndef MODULE_BUILTIN
#define MODULE_BUILTIN					0
#endif

#ifndef MODULE_WT
#define MODULE_WT						0
#endif

#if MODULE_TRAMPA
#define UART_RX							2
#define UART_TX							1
#define UART_TX_DISABLED				25
#define EN_DEFAULT						1
#define LED_PIN							3
#elif MODULE_BUILTIN
#define UART_RX							1
#define UART_TX							2
#define UART_TX_DISABLED				25
#define EN_DEFAULT						1
#define LED_PIN							3
#elif MODULE_WT
#define UART_RX							1
#define UART_TX							2
#define UART_TX_DISABLED				25
#define EN_DEFAULT						1
#define LED_PIN							3
#else
#define UART_RX							11
#define UART_TX							9
#define UART_TX_DISABLED				25
#define EN_DEFAULT						1
#define LED_PIN							3
#endif

// https://devzone.nordicsemi.com/question/59389/solved-help-with-wgt51822-s2-module/
#undef NRF_CLOCK_LFCLKSRC
#define NRF_CLOCK_LFCLKSRC      {.source        = NRF_CLOCK_LF_SRC_SYNTH,           \
                                 .rc_ctiv       = 0,                                \
                                 .rc_temp_ctiv  = 0,                                \
                                 .xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_20_PPM}

// Defines
#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE            GATT_MTU_SIZE_DEFAULT                       /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define CENTRAL_LINK_COUNT              0                                           /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1                                           /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#if MODULE_BUILTIN
#define DEVICE_NAME                     "VESC BUILTIN BLE"
#else
#define DEVICE_NAME                     "VESC BLE UART"
#endif

#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL               6											/**< Minimum acceptable connection interval (7.5 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               25											/**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#ifndef FW_16K
#define UART_TX_BUF_SIZE                1024
#define UART_RX_BUF_SIZE                8192
#else
#define UART_TX_BUF_SIZE                256
#define UART_RX_BUF_SIZE                512
#endif

#define PACKET_VESC						0
#define PACKET_BLE						1

