livello/nrf51_vesc/main.c
APP_TIMER_DEF(m_packet_timer);
APP_TIMER_DEF(gear_button_timer);
#ifndef FW_16K
APP_TIMER_DEF(m_nrf_timer);
#endif

#define GEAR_IN_A 23
#define GEAR_IN_B 24
#define GEAR_SENSOR 30
#define GEAR_BUTTON 0

#define PERIOD_GEAR_BUTTON_TIMER 50

static int gear_waiting(void);
static int gear_falling(void);
static int gear_rising(void);

// Private variables
static ble_nus_t                        m_nus;                                      //NUS: Nordic UART Service initialization structure. /**https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.sdk5.v11.0.0%2Fgroup__ble__sdk__srv__nus.html**/
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;
static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}}; /**https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.s132.api.v2.0.0%2Fstructble__uuid__t.html**/
static bool								m_is_enabled = EN_DEFAULT;
static bool								m_uart_error = false;
static int								m_other_comm_disable_time = 0;

static app_uart_comm_params_t m_uart_comm_params = {
		UART_RX,                                     //rx_pin_no
		EN_DEFAULT ? UART_TX : UART_TX_DISABLED,     //tx_pin_no
		0,                                           //rts_pin_no
		0,                                           //cts_pin_no
		APP_UART_FLOW_CONTROL_DISABLED,              //flow_control
		false,                                       //use_parity
		UART_BAUDRATE_BAUDRATE_Baud115200            //baud_rate
};

void my_printf(const char* format, ...) {
#if PRINT_EN
	va_list arg;
	va_start (arg, format);
	int len;
	static char print_buffer[255];

	len = vsnprintf(print_buffer, 255, format, arg);
	va_end (arg);

	for (int i = 0;i < len;i++) {
		app_uart_put(print_buffer[i]);
	}
#else
	(void)format;
#endif
}

/*
 * NOTE:
 * APP_ERROR_HANDLER resets the CPU, which results in an immediate disconnect.
 * APP_ERROR_CHECK calls APP_ERROR_HANDLER on errors.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {
	app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**
 * @brief
 * GAP is an acronym for the Generic Access Profile, and it controls connections and advertising in Bluetooth.
 * GAP is what makes your device visible to the outside world,
 * and determines how two devices can (or can't) interact with each other
 * quoted from: https://learn.adafruit.com/introduction-to-bluetooth-low-energy/gap
 */
static void gap_params_init(void) {
	uint32_t                err_code;
	ble_gap_conn_params_t   gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(&sec_mode,
			(const uint8_t *) DEVICE_NAME,
			strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency     = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

/**
 * @brief  Event handler to be called for handling received data.
 *         this calls VESC's packet_process_byte function in packet.c
 *         Phone -> BLE
 * https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.sdk5.v12.0.0%2Fstructble__nus__init__t.html
 * @param  p_nus :
 * @param  p_data :
 * @param  length :
 */
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length) {
	(void)p_nus;

	for (uint32_t i = 0; i < length; i++) {
		packet_process_byte(p_data[i], PACKET_BLE);
	}
}

static void services_init(void) {
	uint32_t       err_code;
	ble_nus_init_t nus_init;

	memset(&nus_init, 0, sizeof(nus_init));

	nus_init.data_handler = nus_data_handler;

	err_code = ble_nus_init(&m_nus, &nus_init);
	APP_ERROR_CHECK(err_code);
}

static void on_conn_params_evt(ble_conn_params_evt_t * p_evt) {
	uint32_t err_code;

	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
		APP_ERROR_CHECK(err_code);
	}
}

static void conn_params_error_handler(uint32_t nrf_error) {
	APP_ERROR_HANDLER(nrf_error);
}


/**
 * @brief  Connection Parameters Module init structure.
 * This contains all options and data needed for initialization of the connection parameters negotiation module.
 * https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.sdk5.v12.0.0%2Fstructble__conn__params__init__t.html
 *
 */
static void conn_params_init(void) {
	uint32_t               err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params                  = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail             = false;
	cp_init.evt_handler                    = on_conn_params_evt;
	cp_init.error_handler                  = conn_params_error_handler;

	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);
}

static void on_adv_evt(ble_adv_evt_t ble_adv_evt) {
	switch (ble_adv_evt) {
	case BLE_ADV_EVT_FAST:

		break;
	case BLE_ADV_EVT_IDLE: {
//		sleep_mode_enter();
		// start advertising again
		ret_code_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
		APP_ERROR_CHECK(err_code);
	} break;
	default:
		break;
	}
}

static void on_ble_evt(ble_evt_t * p_ble_evt) {
	uint32_t err_code;

	switch (p_ble_evt->header.evt_id) {
	case BLE_GAP_EVT_CONNECTED:
		m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
		my_printf("Connected\r\n");
		nrf_gpio_pin_set(LED_PIN);
//		nrf_gpio_cfg_output(UART_TX);
//		nrf_gpio_cfg_input(UART_RX, NRF_GPIO_PIN_NOPULL);
		break;

	case BLE_GAP_EVT_DISCONNECTED:
		m_conn_handle = BLE_CONN_HANDLE_INVALID;
		my_printf("Disconnected\r\n");
		nrf_gpio_pin_clear(LED_PIN);
//		nrf_gpio_cfg_default(UART_RX);
//		nrf_gpio_cfg_default(UART_TX);
		break;

	case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
		// Pairing not supported
		err_code = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_SYS_ATTR_MISSING:
		// No system attributes have been stored.
		err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTC_EVT_TIMEOUT:
		// Disconnect on GATT Client timeout event.
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
				BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_GATTS_EVT_TIMEOUT:
		// Disconnect on GATT Server timeout event.
		err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
				BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
		break;

	case BLE_EVT_USER_MEM_REQUEST:
		err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
		APP_ERROR_CHECK(err_code);
		break;

