livello/nrf51_vesc/main.c
	case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST: {
		ble_gatts_evt_rw_authorize_request_t  req;
		ble_gatts_rw_authorize_reply_params_t auth_reply;

		req = p_ble_evt->evt.gatts_evt.params.authorize_request;

		if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID) {
			if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
					(req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
					(req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL)) {
				if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE) {
					auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
				} else {
					auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
				}
				auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
				err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
						&auth_reply);
				APP_ERROR_CHECK(err_code);
			}
		}
	} break;

#if (NRF_SD_BLE_API_VERSION == 3)
	case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
		err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
				NRF_BLE_MAX_MTU_SIZE);
		APP_ERROR_CHECK(err_code);
		break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

	default:
		break;
	}
}

static void ble_evt_dispatch(ble_evt_t * p_ble_evt) {
	ble_conn_params_on_ble_evt(p_ble_evt);
	ble_nus_on_ble_evt(&m_nus, p_ble_evt);
	on_ble_evt(p_ble_evt);
	ble_advertising_on_ble_evt(p_ble_evt);
}

static void ble_stack_init(void) {
	uint32_t err_code;

	nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

	// Initialize SoftDevice.
	SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

	ble_enable_params_t ble_enable_params;
	err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
			PERIPHERAL_LINK_COUNT,
			&ble_enable_params);
	APP_ERROR_CHECK(err_code);

	//Check the ram settings against the used number of links
	CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

	// Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
	ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
	err_code = softdevice_enable(&ble_enable_params);
	APP_ERROR_CHECK(err_code);

	// Subscribe for BLE events.
	err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
	APP_ERROR_CHECK(err_code);
}

void uart_event_handle(app_uart_evt_t * p_event) {
	switch (p_event->evt_type) {
	case APP_UART_DATA_READY: {
		// Data is processed in main
	} break;

	case APP_UART_COMMUNICATION_ERROR: {
//		APP_ERROR_HANDLER(p_event->data.error_communication);
		m_uart_error = true;
	} break;

	case APP_UART_FIFO_ERROR:
//		APP_ERROR_HANDLER(p_event->data.error_code);
//		uart_error = true;
		app_uart_flush();
		packet_reset(PACKET_VESC);
		break;

	default:
		break;
	}
}
static uint32_t now_millis = 0;
static uint32_t disable_gear_transition_millis = 0;
static int gear_waiting(void){

}
static int gear_falling(void){

}
static int gear_rising(void){

}
static int (* gear_state[])(void) = { gear_waiting, gear_falling, gear_rising};
enum gear_state_codes { waiting, low, high};
enum ret_codes { repeat, done, rising, falling};
struct transition {
    enum gear_state_codes src_state;
    enum ret_codes   ret_code;
    enum gear_state_codes dst_state;
};
struct transition gear_state_transitions[] = {
        {waiting, repeat, waiting },
        {waiting, rising, high },
        {waiting, falling, low },
        {high, repeat, high },
        {high, done, waiting },
        {low, repeat, low },
        {low, done, waiting }
        };

#define EXIT_STATE waiting
#define ENTRY_STATE waiting
enum gear_state_codes gear_cur_state = ENTRY_STATE;

void timer_gear_button_event_handler(void *p_context){
    now_millis+=PERIOD_GEAR_BUTTON_TIMER;
    int (* gear_state_fun)(void);
    gear_state_fun = gear_state[gear_cur_state];
    gear_state_fun();
}


static void gear_init(void)
{
    nrf_gpio_cfg_output(GEAR_IN_A);
    nrf_gpio_pin_write(GEAR_IN_A,0);
    nrf_gpio_cfg_output(GEAR_IN_B);
    nrf_gpio_pin_write(GEAR_IN_B,0);
    nrf_gpio_cfg_input(GEAR_BUTTON,NRF_GPIO_PIN_PULLUP);

}

static void uart_init(void) {
	uint32_t err_code;

	APP_UART_FIFO_INIT(&m_uart_comm_params,
			UART_RX_BUF_SIZE,
			UART_TX_BUF_SIZE,
			uart_event_handle,
			APP_IRQ_PRIORITY_MID,
			err_code);

	APP_ERROR_CHECK(err_code);
}

static void advertising_init(void) {
	uint32_t               err_code;
	ble_advdata_t          advdata;
	ble_advdata_t          scanrsp;
	ble_adv_modes_config_t options;

	// Build advertising data struct to pass into @ref ble_advertising_init.
	memset(&advdata, 0, sizeof(advdata));
	advdata.name_type          = BLE_ADVDATA_FULL_NAME;
	advdata.include_appearance = false;
	advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

	memset(&scanrsp, 0, sizeof(scanrsp));
	scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
	scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

	memset(&options, 0, sizeof(options));
	options.ble_adv_fast_enabled  = true;
	options.ble_adv_fast_interval = APP_ADV_INTERVAL;
	options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

	err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
	APP_ERROR_CHECK(err_code);
}

static void power_manage(void) {
	uint32_t err_code = sd_app_evt_wait();
	APP_ERROR_CHECK(err_code);
}

static void set_enabled(bool en) {
	m_is_enabled = en;

	if (m_is_enabled) {
		app_uart_close();
		m_uart_comm_params.tx_pin_no = UART_TX;
		uart_init();
		nrf_gpio_cfg_default(UART_TX_DISABLED);
	} else {
		app_uart_close();
		m_uart_comm_params.tx_pin_no = UART_TX_DISABLED;
		uart_init();
		nrf_gpio_cfg_default(UART_TX);
	}
}

static void ble_send_buffer(unsigned char *data, unsigned int len) {
	if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
		uint32_t err_code = NRF_SUCCESS;
		int ind = 0;

		while (len > BLE_NUS_MAX_DATA_LEN) {
			do{
				err_code = ble_nus_string_send(&m_nus, data + ind, BLE_NUS_MAX_DATA_LEN);
			} while(m_conn_handle != BLE_CONN_HANDLE_INVALID &&
					err_code == BLE_ERROR_NO_TX_PACKETS);

