livello/nrf51_vesc/main.c
			len -= BLE_NUS_MAX_DATA_LEN;
			ind += BLE_NUS_MAX_DATA_LEN;
		}

		if (len > 0) {
			do{
				err_code = ble_nus_string_send(&m_nus, data + ind, len);
			} while(m_conn_handle != BLE_CONN_HANDLE_INVALID &&
					err_code == BLE_ERROR_NO_TX_PACKETS);
		}

		APP_ERROR_CHECK(err_code);
	}
}

static void uart_send_buffer(unsigned char *data, unsigned int len) {
	for (int i = 0;i < len;i++) {
#ifndef FW_16K
		app_uart_put(data[i]);
#else
		while (app_uart_put(data[i]) == NRF_ERROR_NO_MEM) {
			nrf_delay_us(100);
		}
#endif
	}
}

#ifndef FW_16K
void rfhelp_send_data_crc(uint8_t *data, unsigned int len) {
	uint8_t buffer[len + 2];
	unsigned short crc = crc16((unsigned char*)data, len);
	memcpy(buffer, data, len);
	buffer[len] = (char)(crc >> 8);
	buffer[len + 1] = (char)(crc & 0xFF);
	esb_timeslot_set_next_packet(buffer, len + 2);
}
#endif


/**
 * @brief  ble -> VESC
 * these process function is called when the try_decode_packet() is succeed.
 * @param  data :
 * @param  len :
 */
static void process_packet_ble(unsigned char *data, unsigned int len) {
#ifndef FW_16K
	if (data[0] == COMM_ERASE_NEW_APP ||
			data[0] == COMM_WRITE_NEW_APP_DATA ||
			data[0] == COMM_ERASE_NEW_APP_ALL_CAN ||
			data[0] == COMM_WRITE_NEW_APP_DATA_ALL_CAN) {
		m_other_comm_disable_time = 5000;
	}

	CRITICAL_REGION_ENTER();
	packet_send_packet(data, len, PACKET_VESC);
	CRITICAL_REGION_EXIT();
#else
	packet_send_packet(data, len, PACKET_VESC);
#endif
}

/**
 * @brief  VESC -> BLE
 *
 * @param  data :
 * @param  len :
 */
static void process_packet_vesc(unsigned char *data, unsigned int len) {
	if (data[0] == COMM_EXT_NRF_ESB_SET_CH_ADDR) {
#ifndef FW_16K
		esb_timeslot_set_ch_addr(data[1], data[2], data[3], data[4]);
#endif
	} else if (data[0] == COMM_EXT_NRF_ESB_SEND_DATA) {
#ifndef FW_16K
		rfhelp_send_data_crc(data + 1, len - 1);
#endif
	} else if (data[0] == COMM_EXT_NRF_SET_ENABLED) {
		set_enabled(data[1]);
	} else {
		if (m_is_enabled) {
			packet_send_packet(data, len, PACKET_BLE);
		}
	}
}

#ifndef FW_16K
static void esb_timeslot_data_handler(void *p_data, uint16_t length) {
	if (m_other_comm_disable_time == 0) {
		uint8_t buffer[length + 1];
		buffer[0] = COMM_EXT_NRF_ESB_RX_DATA;
		memcpy(buffer + 1, p_data, length);
		CRITICAL_REGION_ENTER();
		packet_send_packet(buffer, length + 1, PACKET_VESC);
		CRITICAL_REGION_EXIT();
	}
}
#endif

static void packet_timer_handler(void *p_context) {
	(void)p_context;
	packet_timerfunc();

	CRITICAL_REGION_ENTER();
	if (m_other_comm_disable_time > 0) {
		m_other_comm_disable_time--;
	}
	CRITICAL_REGION_EXIT();
}

#ifndef FW_16K
static void nrf_timer_handler(void *p_context) {
	(void)p_context;

	if (m_other_comm_disable_time == 0) {
		uint8_t buffer[1];
		buffer[0] = COMM_EXT_NRF_PRESENT;
		CRITICAL_REGION_ENTER();
		packet_send_packet(buffer, 1, PACKET_VESC);
		CRITICAL_REGION_EXIT();
	}
}
#endif

int main(void) {
	// The EYSGJNZXX and EYSGJNZWY modules use a 32 MHz crystals
#if MODULE_TRAMPA || MODULE_BUILTIN
	NRF_CLOCK->XTALFREQ = 0xFFFFFF00;

	// Start the external high frequency crystal
	NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
	NRF_CLOCK->TASKS_HFCLKSTART = 1;

	// Wait for the external oscillator to start up
	while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) {}
#endif
	nrf_gpio_cfg_output(LED_PIN);
	nrf_gpio_pin_clear(LED_PIN);

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	uart_init();

	packet_init(uart_send_buffer, process_packet_vesc, PACKET_VESC);
	packet_init(ble_send_buffer, process_packet_ble, PACKET_BLE);

	ble_stack_init();
	gap_params_init();
	services_init();
	advertising_init();
	conn_params_init();
	gear_init();

	app_timer_create(&gear_button_timer, APP_TIMER_MODE_REPEATED, timer_gear_button_event_handler);
	app_timer_start(gear_button_timer, APP_TIMER_TICKS(PERIOD_GEAR_BUTTON_TIMER, APP_TIMER_PRESCALER), NULL);

#ifndef FW_16K
	app_timer_create(&m_nrf_timer, APP_TIMER_MODE_REPEATED, nrf_timer_handler);
	app_timer_start(m_nrf_timer, APP_TIMER_TICKS(1000, APP_TIMER_PRESCALER), NULL);

	esb_timeslot_init(esb_timeslot_data_handler);
//	esb_timeslot_set_ch_addr(67, 0xC6, 0xC5, 0x0);
	esb_timeslot_sd_start();
#endif
    app_timer_create(&m_packet_timer, APP_TIMER_MODE_REPEATED, packet_timer_handler);
    app_timer_start(m_packet_timer, APP_TIMER_TICKS(1, APP_TIMER_PRESCALER), NULL);

	ble_advertising_start(BLE_ADV_MODE_FAST);

	for (;;) {
		// Restore uart on errors
		if (m_uart_error) {
			app_uart_close();

			uint32_t error = NRF_UART0->ERRORSRC;
			NRF_UART0->ERRORSRC = error;

			for (int i = 0;i < 6;i++) {
				nrf_uart_event_clear(NRF_UART0, NRF_UART_EVENT_RXDRDY);
				error = NRF_UART0->RXD;
				nrf_delay_us(10);
			}

			uart_init();
			packet_reset(PACKET_VESC);

			nrf_uart_event_clear(NRF_UART0, NRF_UART_EVENT_RXDRDY);
			nrf_uart_event_clear(NRF_UART0, NRF_UART_EVENT_RXTO);
			nrf_uart_event_clear(NRF_UART0, NRF_UART_EVENT_TXDRDY);
			nrf_uart_event_clear(NRF_UART0, NRF_UART_EVENT_ERROR);

			m_uart_error = false;
		}

		// Poll UART
		uint8_t byte;
		while (app_uart_get(&byte) == NRF_SUCCESS) {
			packet_process_byte(byte, PACKET_VESC);
		}

		power_manage();
	}
}
